In [26]:
import numpy as np
import pandas as pd

In [27]:
data=pd.read_csv(r"C:\Users\Rohitshrimangle\Desktop\ineuron\Projects\Internship Projects\Insurance Prediction\notebooks\data\insurance.csv")

In [28]:
data.head(5)

   age     sex   bmi  children smoker     region  expenses
0   19  female  27.9         0    yes  southwest  16884.92
1   18    male  33.8         1     no  southeast   1725.55
2   28    male  33.0         3     no  southeast   4449.46
3   33    male  22.7         0     no  northwest  21984.47
4   32    male  28.9         0     no  northwest   3866.86

In [29]:
data.tail(5)

      age     sex   bmi  children smoker     region  expenses
1333   50    male  31.0         3     no  northwest  10600.55
1334   18  female  31.9         0     no  northeast   2205.98
1335   18  female  36.9         0     no  southeast   1629.83
1336   21  female  25.8         0     no  southwest   2007.95
1337   61  female  29.1         0    yes  northwest  29141.36

In [30]:
data.sample(5)

      age     sex   bmi  children smoker     region  expenses
537    46  female  30.2         2     no  southwest   8825.09
1297   28  female  26.5         2     no  southeast   4340.44
735    49  female  34.8         1     no  northwest   9583.89
464    19    male  25.2         0     no  northwest   1632.04
914    33    male  24.6         2     no  northwest   5257.51

In [31]:
data.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
expenses    0
dtype: int64

In [32]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   expenses  1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [33]:
#data.drop(labels=["id"],axis=1)

In [34]:
data.duplicated().sum()

1

In [35]:
duplicates=data[data.duplicated()]
print(duplicates)

     age   sex   bmi  children smoker     region  expenses
581   19  male  30.6         0     no  northwest   1639.56

In [39]:
data=data.drop_duplicates()

In [40]:
data.duplicated().sum()

0

In [43]:
data.shape

(1337, 7)

In [44]:
data.dtypes

age           int64
sex          object
bmi         float64
children      int64
smoker       object
region       object
expenses    float64
dtype: object

In [45]:
data.dtypes=="object"

age         False
sex          True
bmi         False
children    False
smoker       True
region       True
expenses    False
dtype: bool

In [53]:
categorical_columns=data.columns[data.dtypes=='object']

In [54]:
categorical_columns

Index(['sex', 'smoker', 'region'], dtype='object')

In [55]:
numerical_columns=data.columns[data.dtypes!='object']

In [56]:
numerical_columns

Index(['age', 'bmi', 'children', 'expenses'], dtype='object')

In [60]:
data[categorical_columns]

         sex smoker     region
0     female    yes  southwest
1       male     no  southeast
2       male     no  southeast
3       male     no  northwest
4       male     no  northwest
...      ...    ...        ...
1333    male     no  northwest
1334  female     no  northeast
1335  female     no  southeast
1336  female     no  southwest
1337  female    yes  northwest

[1337 rows x 3 columns]

In [62]:
data[categorical_columns].describe()

         sex smoker     region
count   1337   1337       1337
unique     2      2          4
top     male     no  southeast
freq     675   1063        364

In [58]:
data[numerical_columns]

      age   bmi  children  expenses
0      19  27.9         0  16884.92
1      18  33.8         1   1725.55
2      28  33.0         3   4449.46
3      33  22.7         0  21984.47
4      32  28.9         0   3866.86
...   ...   ...       ...       ...
1333   50  31.0         3  10600.55
1334   18  31.9         0   2205.98
1335   18  36.9         0   1629.83
1336   21  25.8         0   2007.95
1337   61  29.1         0  29141.36

[1337 rows x 4 columns]

In [63]:
data[numerical_columns].describe()

               age          bmi     children      expenses
count  1337.000000  1337.000000  1337.000000   1337.000000
mean     39.222139    30.665520     1.095737  13279.121638
std      14.044333     6.100664     1.205571  12110.359657
min      18.000000    16.000000     0.000000   1121.870000
25%      27.000000    26.300000     0.000000   4746.340000
50%      39.000000    30.400000     1.000000   9386.160000
75%      51.000000    34.700000     2.000000  16657.720000
max      64.000000    53.100000     5.000000  63770.430000

In [64]:
data[numerical_columns].describe().T

,count,mean,std,min,25%,50%,75%,max
age,1337.0,39.222139,14.044333,18.00,27.00,39.00,51.00,64.00
bmi,1337.0,30.665520,6.100664,16.00,26.30,30.40,34.70,53.10
children,1337.0,1.095737,1.205571,0.00,0.00,1.00,2.00,5.00
expenses,1337.0,13279.121638,12110.359657,1121.87,4746.34,9386.16,16657.72,63770.43

In [67]:
data[categorical_columns]["sex"].value_counts()

sex
male      675
female    662
Name: count, dtype: int64

In [70]:
data[categorical_columns]["smoker"].value_counts()

smoker
no     1063
yes     274
Name: count, dtype: int64

In [71]:
data[categorical_columns]['region'].value_counts()

region
southeast    364
southwest    325
northwest    324
northeast    324
Name: count, dtype: int64